In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import matplotlib as plt
import seaborn as sns

In [23]:
df = pd.read_csv("../Social_Network_Ads.csv")

In [7]:
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   User ID          400 non-null    int64
 1   Gender           400 non-null    object
 2   Age              400 non-null    int64
 3   EstimatedSalary  400 non-null    int64
 4   Purchased        400 non-null    int64
dtypes: int64(4), object(1)
memory usage: 15.8+ KB

In [9]:
df.describe()

            User ID         Age  EstimatedSalary   Purchased
count  4.000000e+02  400.000000       400.000000  400.000000
mean   1.569154e+07   37.655000     69742.500000    0.357500
std    7.165832e+04   10.482877     34096.960282    0.479864
min    1.556669e+07   18.000000     15000.000000    0.000000
25%    1.562676e+07   29.750000     43000.000000    0.000000
50%    1.569434e+07   37.000000     70000.000000    0.000000
75%    1.575036e+07   46.000000     88000.000000    1.000000
max    1.581524e+07   60.000000    150000.000000    1.000000

In [24]:
df= df.iloc[:, 2:]
df

     Age  EstimatedSalary  Purchased
0     19            19000          0
1     35            20000          0
2     26            43000          0
3     27            57000          0
4     19            76000          0
..   ...              ...        ...
395   46            41000          1
396   51            23000          1
397   50            20000          1
398   36            33000          0
399   49            36000          1

[400 rows x 3 columns]

In [13]:
from sklearn.model_selection import train_test_split

In [28]:
input_cols = df.columns.to_list()[0:2]
input_cols
target_cols = df.columns.to_list()[2]
target_cols

'Purchased'

In [16]:
Xtrain, Xtest, Ytrain, Ytest = train_test_split(df.drop("Purchased", axis = 1), df["Purchased"], test_size= 0.2, random_state=42)

In [17]:
Xtest.shape, Xtrain.shape

((80, 2), (320, 2))

In [18]:
from sklearn.preprocessing import StandardScaler

In [31]:
scaler = StandardScaler()
scaler.fit(Xtrain)
Xtrain_scaled = scaler.transform(Xtrain)
Xtest_scaled = scaler.transform(Xtest)

In [32]:
Xtest_scaled

array([[ 0.79753468, -1.40447546],
       [ 2.07309956,  0.51542886],
       [-0.96863208, -0.76450736],
       [ 0.99377543,  0.74814454],
       [-0.87051171, -1.22993871],
       [-0.77239133, -0.24089709],
       [ 0.89565505,  1.06812859],
       [-0.87051171,  0.36998156],
       [ 0.20881242,  0.13726589],
       [ 0.40505317, -0.15362871],
       [-0.28178945, -0.15362871],
       [ 1.4843773 , -1.05540195],
       [-1.45923396, -0.64814952],
       [-1.75359508, -1.37538601],
       [-0.77239133,  0.4863394 ],
       [-0.28178945,  1.09721805],
       [ 1.38625693, -0.93904411],
       [ 0.79753468,  0.10817643],
       [ 0.11069205, -0.82268628],
       [ 1.77873843, -0.29907601],
       [-1.55735433, -1.25902817],
       [-0.87051171,  0.28271318],
       [ 0.89565505, -1.37538601],
       [ 2.07309956,  0.16635535],
       [-1.85171546, -1.49174384],
       [ 1.28813655, -1.37538601],
       [ 0.40505317,  0.28271318],
       [-0.0855487 , -0.50270222],
       [ 1.68061805,  1.59173886],
       [-1.85171546, -1.43356492],
       [ 0.79753468, -0.85177573],
       [-1.85171546, -0.00818141],
       [-0.18366908,  2.14443859],
       [-0.96863208,  0.25362372],
       [ 0.20881242,  1.06812859],
       [-0.28178945,  0.13726589],
       [-0.0855487 , -0.4445233 ],
       [ 0.01257167, -0.15362871],
       [-1.16487283, -1.17175979],
       [-1.94983583, -0.06636033],
       [ 0.99377543, -1.08449141],
       [-1.36111358, -0.4445233 ],
       [-1.94983583, -0.53179168],
       [ 0.89565505, -1.46265438],
       [-1.75359508, -0.61906006],
       [ 0.60129393,  1.99899129],
       [-0.87051171, -0.26998655],
       [-0.67427095,  0.02090805],
       [ 0.99377543, -0.85177573],
       [-0.37990983, -0.79359682],
       [-1.26299321,  0.25362372],
       [ 1.4843773 ,  0.3408921 ],
       [ 0.01257167, -0.4445233 ],
       [-1.26299321,  0.28271318],
       [-0.0855487 ,  0.28271318],
       [-1.06675246, -1.14267033],
       [ 2.17121993,  0.92268129],
       [-1.16487283,  1.38811264],
       [-0.67427095,  0.10817643],
       [-0.67427095,  0.16635535],
       [ 0.3069328 , -0.56088114],
       [-0.28178945, -0.38634438],
       [ 1.38625693,  0.57360778],
       [-0.96863208,  0.4863394 ],
       [-0.96863208, -0.32816546],
       [-1.06675246,  1.94081237],
       [ 0.40505317,  0.57360778],
       [ 0.89565505,  2.14443859],
       [ 0.11069205, -0.32816546],
       [-0.4780302 ,  1.24266535],
       [ 1.38625693,  1.96990183],
       [-1.85171546,  0.42816048],
       [-1.06675246, -0.35725492],
       [-1.45923396, -1.46265438],
       [ 0.89565505, -1.05540195],
       [-0.28178945, -0.5899706 ],
       [ 1.77873843,  1.82445454],
       [ 1.58249768, -1.28811763],
       [-0.28178945, -0.67723898],
       [-0.0855487 ,  0.22453427]])

In [34]:
Xtrain_scaled = pd.DataFrame(Xtrain_scaled, columns= Xtrain.columns)
Xtest_scaled = pd.DataFrame(Xtest_scaled, columns= Xtrain.columns)

In [35]:
Xtrain_scaled, Xtest_scaled

(          Age  EstimatedSalary
 0   -1.066752        -0.386344
 1    0.797535        -1.229939
 2    0.110692         1.853544
 3    0.601294        -0.909955
 4    1.876859        -1.288118
 ..        ...              ...
 315 -1.361114        -1.259028
 316 -1.164873        -1.026312
 317  0.503174         1.824455
 318  0.110692         0.195445
 319 -0.576151         0.457250

 [320 rows x 2 columns],
          Age  EstimatedSalary
 0   0.797535        -1.404475
 1   2.073100         0.515429
 2  -0.968632        -0.764507
 3   0.993775         0.748145
 4  -0.870512        -1.229939
 ..       ...              ...
 75 -0.281789        -0.589971
 76  1.778738         1.824455
 77  1.582498        -1.288118
 78 -0.281789        -0.677239
 79 -0.085549         0.224534

 [80 rows x 2 columns])

In [36]:
Xtrain_scaled.describe(
    
)

                Age  EstimatedSalary
count  3.200000e+02     3.200000e+02
mean  -2.775558e-16     1.110223e-17
std    1.001566e+00     1.001566e+00
min   -1.949836e+00    -1.608102e+00
25%   -7.723913e-01    -7.935968e-01
50%   -8.554870e-02     2.090805e-02
75%    6.994143e-01     5.154289e-01
max    2.171220e+00     2.318975e+00